app/controllers/products_controller.rb

  def index
    @products = Product.all
---
SELECT * FROM "products"

  def show
    @product = Product.find(params[:id])
---
SELECT * FROM "products" WHERE ("products"."id" = 1)

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "productdesc", "button_version", "updated_at", "app_version", "productname") VALUES('2010-10-04 22:35:16', 'A fun torture device for everyone.', NULL, '2010-10-04 22:35:16', NULL, 'thumbscrews')